In [87]:
import pandas as pd
import numpy as np

In [88]:
people= {"first" : ["agung","NA","mandako","budi",np.nan,None],
        "last":["dwipa","Missing",np.nan,np.nan,"juliantari","tugus"],
        "email": ["agungdwipa@gmail.com","kuraoanas@gmail.com","NA","budi@mail.com",np.nan,None],
        "age": ["12","14",None,np.nan,None,"Missing"]}

In [89]:
data= pd.DataFrame(people)
data.replace("NA",np.nan,inplace=True)
data.replace("Missing",np.nan,inplace=True)

In [90]:
data

     first        last                 email   age
0    agung       dwipa  agungdwipa@gmail.com    12
1      NaN         NaN   kuraoanas@gmail.com    14
2  mandako         NaN                   NaN  None
3     budi         NaN         budi@mail.com   NaN
4      NaN  juliantari                   NaN  None
5     None       tugus                  None   NaN

In [91]:
data.dropna(how='all',subset=["last","email"],inplace=True)

In [92]:
data

   first        last                 email   age
0  agung       dwipa  agungdwipa@gmail.com    12
1    NaN         NaN   kuraoanas@gmail.com    14
3   budi         NaN         budi@mail.com   NaN
4    NaN  juliantari                   NaN  None
5   None       tugus                  None   NaN

In [93]:
data.isna()

   first   last  email    age
0  False  False  False  False
1   True   True  False  False
3  False   True  False   True
4   True  False   True   True
5   True  False   True   True

In [94]:
data.fillna(0,inplace=True)

In [95]:
data.dtypes
data

   first        last                 email age
0  agung       dwipa  agungdwipa@gmail.com  12
1      0           0   kuraoanas@gmail.com  14
3   budi           0         budi@mail.com   0
4      0  juliantari                     0   0
5      0       tugus                     0   0

In [102]:
data["age"] = data["age"].astype(float) # cannot change type string

In [103]:
data.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [104]:
data["age"].mean()

5.2